OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/2_2_floorplan_macro.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 435 tapcells.
Design area 2016 um^2 6% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.41[h:]min:sec. CPU time: user 0.36 sys 0.06 (102%). Peak memory: 119744KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            116 98c865690ac4d490a670
