OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/3_1_place_gp_skip_io.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/2_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
place_pins -hor_layers met3 -ver_layers met2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 718
[INFO PPL-0002] Number of I/O             29
[INFO PPL-0003] Number of I/O w/sink      29
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 2525.96 um.
Design area 2016 um^2 6% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_alu8/results/sky130hd/alu8/base/3_2_place_iop.odb
Elapsed time: 0:00.42[h:]min:sec. CPU time: user 0.38 sys 0.04 (101%). Peak memory: 121068KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            118 1c878c0439741a42fd04
