OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_shift_left4/results/sky130hd/shift_left4/base/2_2_floorplan_macro.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_shift_left4/results/sky130hd/shift_left4/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 435 tapcells.
Design area 693 um^2 2% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_shift_left4/results/sky130hd/shift_left4/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:01.08[h:]min:sec. CPU time: user 0.44 sys 0.06 (46%). Peak memory: 120404KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              1            117 43647ea0b64735ef0b4b
