OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_updown_counter16/results/sky130hd/updown_counter16/base/2_3_floorplan_tapcell.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_updown_counter16/results/sky130hd/updown_counter16/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 1871 um^2 6% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_updown_counter16/results/sky130hd/updown_counter16/base/2_4_floorplan_pdn.odb
Elapsed time: 0:01.14[h:]min:sec. CPU time: user 0.43 sys 0.10 (46%). Peak memory: 123876KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  1            120 2feacb1708810d8e837f
