OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_3_floorplan_tapcell.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 937 um^2 3% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.46[h:]min:sec. CPU time: user 0.40 sys 0.08 (102%). Peak memory: 123528KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            120 c03a422ba6fdacaa7cc9
