OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/3_3_place_gp.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
estimate_parasitics -placement
Perform buffer insertion and gate resizing...
repair_design -verbose -match_cell_footprint
Iteration |   Area    | Resized | Buffers | Nets repaired | Remaining
---------------------------------------------------------------------
        0 |     +0.0% |       0 |       0 |             0 |        56
       10 |     +0.0% |       0 |       0 |             0 |        46
       20 |     +0.0% |       0 |       0 |             0 |        36
       30 |     +0.0% |       0 |       0 |             0 |        26
       40 |     +0.0% |       0 |       0 |             0 |        16
       50 |     +0.0% |       0 |       0 |             0 |         6
    final |     +0.0% |       0 |       0 |             0 |         0
---------------------------------------------------------------------
Floating nets: 
Report metrics stage 3, resizer...

==========================================================================
resizer report_design_area
--------------------------------------------------------------------------
Design area 1037 um^2 3% utilization.
Instance count before 487, after 487
Pin count before 153, after 153
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/3_4_place_resized.odb
Elapsed time: 0:01.70[h:]min:sec. CPU time: user 0.50 sys 0.14 (38%). Peak memory: 141056KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_4_place_resized                  1            137 f776a6180f18e0eb66d2
