OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_exp_fixed_point/results/sky130hd/exp_fixed_point/base/3_1_place_gp_skip_io.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_exp_fixed_point/results/sky130hd/exp_fixed_point/base/2_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
place_pins -hor_layers met3 -ver_layers met2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 718
[INFO PPL-0002] Number of I/O             5
[INFO PPL-0003] Number of I/O w/sink      1
[INFO PPL-0004] Number of I/O w/o sink    4
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 77.93 um.
Design area 556 um^2 2% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_exp_fixed_point/results/sky130hd/exp_fixed_point/base/3_2_place_iop.odb
Elapsed time: 0:00.43[h:]min:sec. CPU time: user 0.33 sys 0.06 (91%). Peak memory: 120612KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            117 c644a81dfde1bd26dbca
