###############################################################################
# Created by write_sdc
###############################################################################
current_design seq_detector_0011
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
set_false_path\
    -from [get_ports {reset}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
