OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_seq_detector_0011/results/sky130hd/seq_detector_0011/base/2_3_floorplan_tapcell.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_seq_detector_0011/results/sky130hd/seq_detector_0011/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 556 um^2 2% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_seq_detector_0011/results/sky130hd/seq_detector_0011/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.47[h:]min:sec. CPU time: user 0.36 sys 0.07 (90%). Peak memory: 122644KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            119 131619baf717eb53530f
