OpenROAD 26Q2-209-g0d9d73ffba 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
read_liberty /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_1_floorplan.odb
read_sdc /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_1_floorplan.sdc
source /home/sudar762/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 393 um^2 1% utilization.
write_db /home/sudar762/projects/spec-to-rtl-agent/build/orfs_work_text_counter/results/sky130hd/text_counter/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.67[h:]min:sec. CPU time: user 0.39 sys 0.09 (71%). Peak memory: 118988KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            116 487803190f549b892469
